Устанавливаем нужные библиотеки

In [35]:
!pip install XlsxWriter

Requirement already satisfied: XlsxWriter in /Users/michil/.virtualenvs/cs102/lib/python3.8/site-packages (1.3.7)

In [36]:
import pandas as pd
import numpy as np

In [37]:
df = pd.read_csv('data/checkins.csv')

/Users/michil/.virtualenvs/cs102/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [38]:
df.head()

,id,user_id,venue_id,latitude,longitude,created_at
0,984301,2041916.0,5222.0,,,2012-04-21 17:39:01
1,984222,15824.0,5222.0,38.8951118,-77.0363658,2012-04-21 17:43:47
2,984315,1764391.0,5222.0,,,2012-04-21 17:37:18
3,984234,44652.0,5222.0,33.800745,-84.41052,2012-04-21 17:43:43
4,984249,2146840.0,5222.0,,,2012-04-21 17:42:58

In [39]:
df_excel = pd.read_excel('data/df_excel.xlsx')

In [40]:
df_excel.head()

   Unnamed: 0      id  user_id
0           0  984301  2041916
1           1  984222    15824
2           2  984315  1764391
3           3  984234    44652
4           4  984249  2146840

In [41]:
df_json = pd.read_json('data/df_json.json')

In [42]:
df_json.head()

       id  venue_id          created_at
0  984301      5222 2012-04-21 17:39:01
1  984222      5222 2012-04-21 17:43:47
2  984315      5222 2012-04-21 17:37:18
3  984234      5222 2012-04-21 17:43:43
4  984249      5222 2012-04-21 17:42:58

### Соединение

- Можно либо `merge` сделать

In [43]:
new_df = df_excel.merge(
    df_json, #с чем соединяем
    on='id' #по какой колонке
)

In [44]:
new_df.head()

   Unnamed: 0      id  user_id  venue_id          created_at
0           0  984301  2041916      5222 2012-04-21 17:39:01
1           1  984222    15824      5222 2012-04-21 17:43:47
2           2  984315  1764391      5222 2012-04-21 17:37:18
3           3  984234    44652      5222 2012-04-21 17:43:43
4           4  984249  2146840      5222 2012-04-21 17:42:58

- Либо hstack

In [45]:
n_n = np.hstack((df_excel, df_json))

stacked_df = pd.DataFrame(n_n)

In [46]:
stacked_df.head()

   0       1        2       3     4                   5
0  0  984301  2041916  984301  5222 2012-04-21 17:39:01
1  1  984222    15824  984222  5222 2012-04-21 17:43:47
2  2  984315  1764391  984315  5222 2012-04-21 17:37:18
3  3  984234    44652  984234  5222 2012-04-21 17:43:43
4  4  984249  2146840  984249  5222 2012-04-21 17:42:58

In [47]:
columns = ['index', 'id1', 'user_id', 'id2', 'venue_id', 'created_at']

In [48]:
stacked_df.columns = columns

In [49]:
stacked_df.head()

  index     id1  user_id     id2 venue_id          created_at
0     0  984301  2041916  984301     5222 2012-04-21 17:39:01
1     1  984222    15824  984222     5222 2012-04-21 17:43:47
2     2  984315  1764391  984315     5222 2012-04-21 17:37:18
3     3  984234    44652  984234     5222 2012-04-21 17:43:43
4     4  984249  2146840  984249     5222 2012-04-21 17:42:58

### Добавляем из csv

Продолжим добавлять в new_df

In [50]:
df_csv = pd.read_csv('data/df_csv.csv')

In [51]:
df_csv.head()

   Unnamed: 0      id             latitude            longitude
0           0  984301
1           1  984222          38.8951118          -77.0363658
2           2  984315
3           3  984234           33.800745            -84.41052
4           4  984249

In [52]:
df_csv.drop('Unnamed: 0', axis=1, inplace=True)

In [53]:
full_df = new_df.merge(
    df_csv,
    on='id'
)

In [54]:
full_df.head()

,Unnamed: 0,id,user_id,venue_id,created_at,latitude,longitude
0,0,984301,2041916,5222,2012-04-21 17:39:01,,
1,1,984222,15824,5222,2012-04-21 17:43:47,38.8951118,-77.0363658
2,2,984315,1764391,5222,2012-04-21 17:37:18,,
3,3,984234,44652,5222,2012-04-21 17:43:43,33.800745,-84.41052
4,4,984249,2146840,5222,2012-04-21 17:42:58,,

Дальше обрабатываем: нормализация и тп
- Достанем даты

In [32]:
days = []
months = []
years = []
weekdays = []

for date in full_df.created_at:
    y, m, d = date.year, date.month, date.day
    weekday = date.weekday()
    
    days.append(d)
    months.append(m)
    years.append(y)
    weekdays.append(weekday)

In [55]:
full_df['day'] = days
full_df['month'] = months
full_df['year'] = years
full_df['weekday'] = weekdays

In [56]:
full_df.head()

,Unnamed: 0,id,user_id,venue_id,created_at,latitude,longitude,day,month,year,weekday
0,0,984301,2041916,5222,2012-04-21 17:39:01,,,21,4,2012,5
1,1,984222,15824,5222,2012-04-21 17:43:47,38.8951118,-77.0363658,21,4,2012,5
2,2,984315,1764391,5222,2012-04-21 17:37:18,,,21,4,2012,5
3,3,984234,44652,5222,2012-04-21 17:43:43,33.800745,-84.41052,21,4,2012,5
4,4,984249,2146840,5222,2012-04-21 17:42:58,,,21,4,2012,5